tests/load/artillery.yml
config:
  target: "http://localhost:3000"
  phases:
    - name: "Warm up"
      duration: 30
      arrivalRate: 5

    - name: "Ramp up — 1k requests"
      duration: 60
      arrivalRate: 17
      rampTo: 50

    - name: "Sustained load — 10k requests"
      duration: 120
      arrivalRate: 83

    - name: "Peak load — 100k requests"
      duration: 300
      arrivalRate: 333

  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  # ── Redirect hot path (cache-hit scenario) ──────────────────────────────────
  - name: "Redirect short URL"
    weight: 70
    flow:
      - get:
          url: "/abc1234"
          expect:
            - statusCode: 302
            - statusCode: 404  # acceptable if code doesn't exist

  # ── URL creation ────────────────────────────────────────────────────────────
  - name: "Create short URL (unauthenticated)"
    weight: 20
    flow:
      - post:
          url: "/api/url"
          json:
            originalUrl: "https://example.com/test-{{ $randomNumber() }}"
          capture:
            - json: "$.data.url.shortCode"
              as: "shortCode"

  # ── Health check ─────────────────────────────────────────────────────────────
  - name: "Health check"
    weight: 10
    flow:
      - get:
          url: "/health"
          expect:
            - statusCode: 200

reporting:
  - type: json
    filename: tests/load/results/report.json
  - type: html
    filename: tests/load/results/report.html